In [1]:
import pandas as pd
import numpy as np

In [2]:
df_train = pd.read_csv("SOURCES/titanic_train.csv")
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df_train["Alone"] = df_train["SibSp"] + df_train["Parch"]

In [4]:
df_train["Alone"].value_counts()

Alone
0     537
1     161
2     102
3      29
5      22
4      15
6      12
10      7
7       6
Name: count, dtype: int64

In [5]:
df_train.loc[df_train['Alone'].isin(list(range(1, 11))), 'Alone'] = 1

In [6]:
df_train["Alone"].value_counts()

Alone
0    537
1    354
Name: count, dtype: int64

In [7]:
df_train.drop(columns=["Name", "Ticket", "Cabin", "SibSp", "Parch"], inplace=True)

In [8]:
df_train.head()

   PassengerId  Survived  Pclass     Sex   Age     Fare Embarked  Alone
0            1         0       3    male  22.0   7.2500        S      1
1            2         1       1  female  38.0  71.2833        C      1
2            3         1       3  female  26.0   7.9250        S      0
3            4         1       1  female  35.0  53.1000        S      1
4            5         0       3    male  35.0   8.0500        S      0

In [9]:
df_train.loc[df_train['Sex'].isin(["male"]), 'Sex'] = 1
df_train.loc[df_train['Sex'].isin(["female"]), 'Sex'] = 2
# df_train.replace({"male":1, "female":2}, inplace=True)
df_train.loc[df_train['Embarked'].isin(["S"]), 'Embarked'] = 1
df_train.loc[df_train['Embarked'].isin(["C"]), 'Embarked'] = 2
df_train.loc[df_train['Embarked'].isin(["Q"]), 'Embarked'] = 3
# df_train.replace({"S":1, "C":2, "Q":3}, inplace=True)

In [10]:
df_train.head()

   PassengerId  Survived  Pclass Sex   Age     Fare Embarked  Alone
0            1         0       3   1  22.0   7.2500        1      1
1            2         1       1   2  38.0  71.2833        2      1
2            3         1       3   2  26.0   7.9250        1      0
3            4         1       1   2  35.0  53.1000        1      1
4            5         0       3   1  35.0   8.0500        1      0

In [11]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   Fare         891 non-null    float64
 6   Embarked     889 non-null    object
 7   Alone        891 non-null    int64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [18]:
embarked_top = df_train["Embarked"].describe().loc["top"]
embarked_top

1

In [20]:
age_median = df_train["Age"].median()
age_median

28.0

In [24]:
df_train.loc[df_train['Embarked'].isin([np.nan]), 'Embarked'] = embarked_top
df_train.loc[df_train['Age'].isin([np.nan]), 'Age'] = age_median

In [25]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          891 non-null    float64
 5   Fare         891 non-null    float64
 6   Embarked     891 non-null    object
 7   Alone        891 non-null    int64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [26]:
df_train.head()

   PassengerId  Survived  Pclass Sex   Age     Fare Embarked  Alone
0            1         0       3   1  22.0   7.2500        1      1
1            2         1       1   2  38.0  71.2833        2      1
2            3         1       3   2  26.0   7.9250        1      0
3            4         1       1   2  35.0  53.1000        1      1
4            5         0       3   1  35.0   8.0500        1      0

In [ ]:
X = df_train()